# DesignToFabricationConverter Properties

---
The DesignToFabricationConverter type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
DesignToFabricationConverter Class
Autodesk.Revit.DB.Fabrication Namespace